rbarzic/elua/src/platform/sim3u1xx/platform.c
#if defined( DEBUG_I2C )
    printf("CONTROL = %lx\n",  i2cs[ id ]->CONTROL.u32 );
#endif
    if( SI32_I2C_A_is_ack_received(SI32_I2C_0) )
      return 1;
    else
      return 0;
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("send_byte: not active\n");
#endif
    return 0;
  }
}

int platform_i2c_recv_byte( unsigned id, int ack )
{
  u32 tmpdata;
  if ( SI32_I2C_A_is_busy( i2cs[ id ] ) )
  {
#if defined( DEBUG_I2C )
    printf("CONTROL = %lx\n",  i2cs[ id ]->CONTROL.u32 );
#endif

    SI32_I2C_A_set_byte_count( i2cs[ id ] , 1);
    SI32_I2C_A_arm_rx( i2cs[ id ] );

    if( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_rx_interrupt ( i2cs[ id ] );
    else if( SI32_I2C_A_is_tx_interrupt_pending( i2cs[ id ] ) )
      SI32_I2C_A_clear_tx_interrupt ( i2cs[ id ] );

    while( SI32_I2C_A_is_ack_interrupt_pending( i2cs[ id ] ) == 0 );

    if( ack )
      SI32_I2C_A_send_ack( i2cs[ id ] );
    else
      SI32_I2C_A_send_nack( i2cs[ id ] );

    SI32_I2C_A_clear_ack_interrupt( i2cs[ id ] );

    while( SI32_I2C_A_is_rx_interrupt_pending( i2cs[ id ] ) == 0 );

    tmpdata = SI32_I2C_A_read_data( i2cs[ id ] );
#if defined( DEBUG_I2C )
    printf("Got: %u\n",(u8)tmpdata);
    if( 0xFFFFFF00 & tmpdata )
      printf("GOT MORE THAN ONE BYTE!\n");

    printf("CONTROL = %lx\n",  i2cs[ id ]->CONTROL.u32 );
#endif

      return ( u8 )tmpdata;
  }
  else
  {
#if defined( DEBUG_I2C )
    printf("recv_byte: not active\n");
#endif
    return 0;
  }
}

#endif // NUM_I2C > 0

// ****************************************************************************
// PMU functions

void sim3_pmu_sleep( unsigned seconds )
{
  // GET CURRENT TIMER VALUE INTO SETCAP
  SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  SI32_RTC_A_write_alarm0(SI32_RTC_0, SI32_RTC_A_read_setcap(SI32_RTC_0) + (16384 * seconds));
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

  // Enable RTC alarm interrupt
  SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  // Disable crossbar peripheral connections
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);

  // Mask low priority interrupts from waking us
  __set_BASEPRI(0x40);

  SI32_DMACTRL_A_disable_module( SI32_DMACTRL_0 );
  SI32_CLKCTRL_A_exit_fast_wake_mode( SI32_CLKCTRL_0 );
  SI32_RSTSRC_A_disable_power_mode_9( SI32_RSTSRC_0 );

  // Switch VREG to low power mode
  SI32_VREG_A_disable_band_gap( SI32_VREG_0 );
  SI32_VREG_A_enter_suspend_mode( SI32_VREG_0 );
  //SI32_VREG_A_enable_vbus_invalid_interrupt( SI32_VREG_0 );

  // Disable VDD Monitor
  SI32_VMON_A_disable_vdd_supply_monitor(SI32_VMON_0);

  // Switch AHB source to LFO oscillator
  SI32_CLKCTRL_A_select_ahb_source_low_frequency_oscillator( SI32_CLKCTRL_0 );

  // Turn off all peripheral clocks
  SI32_CLKCTRL_A_disable_apb_to_all_modules( SI32_CLKCTRL_0 );

  __WFI();

  SI32_CLKCTRL_A_select_ahb_source_low_power_oscillator(SI32_CLKCTRL_0);

  // Allow all interrupts
  __set_BASEPRI(0x00);

  // Re-enable clocks used at startup
  clk_init();
  pios_init();

  SI32_VREG_A_enable_band_gap( SI32_VREG_0 );
  SI32_EXTVREG_A_enable_module( SI32_EXTVREG_0 );
}

void sim3_pmu_reboot( void )
{
  // Stop USB
  SI32_USB_A_reset_module( SI32_USB_0 );
  NVIC_DisableIRQ(USB0_IRQn);
  SI32_USB_A_disable_module(SI32_USB_0);
  SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );

  SI32_RSTSRC_A_generate_software_reset( SI32_RSTSRC_0 );
}

void sim3_pmu_pm9( unsigned seconds )
{
  u8 i;
  // GET CURRENT TIMER VALUE INTO SETCAP
  SI32_RTC_A_start_timer_capture(SI32_RTC_0);
  while(SI32_RTC_A_is_timer_capture_in_progress(SI32_RTC_0));

  // SET ALARM FOR now+s
  // RTC running at 16.384Khz so there are 16384 cycles/sec)
  SI32_RTC_A_write_alarm0(SI32_RTC_0, SI32_RTC_A_read_setcap(SI32_RTC_0) + (16384 * seconds));
  SI32_RTC_A_clear_alarm0_interrupt(SI32_RTC_0);

/*
  SI32_CMP_A_select_positive_input(SI32_CMP_0, 5);
  SI32_CMP_A_select_negative_input(SI32_CMP_0, 5);
  SI32_CMP_A_select_positive_hysteresis_20mv(SI32_CMP_0);
  SI32_CMP_A_select_negative_hysteresis_20mv(SI32_CMP_0);
  //SI32_CMP_A_enable_positive_weak_pullup( SI32_CMP_0 );
  SI32_CMP_A_select_response_power_mode(SI32_CMP_0, 3);
  SI32_CMP_A_disable_inverted_output(SI32_CMP_0);
  //SI32_CMP_A_enable_inverted_output( SI32_CMP_0);

  SI32_CMP_A_enable_module( SI32_CMP_0 );
*/
  // SI32_CMP_A_enable_falling_edge_interrupt(SI32_CMP_0);
  // SI32_CMP_A_enable_rising_edge_interrupt(SI32_CMP_0);

  // Stop USB
  SI32_USB_A_reset_module( SI32_USB_0 );
  NVIC_DisableIRQ(USB0_IRQn);
  SI32_USB_A_disable_module(SI32_USB_0);
  SI32_USB_A_disable_internal_pull_up( SI32_USB_0 );


  // Enable RTC alarm interrupt
  SI32_RTC_A_enable_alarm0_interrupt(SI32_RTC_0);

  // Disable crossbar peripheral connections
  //SI32_PBCFG_A_write_xbar1(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0h(SI32_PBCFG_0,0x00000000);
  //SI32_PBCFG_A_write_xbar0l(SI32_PBCFG_0,0x00000000);

  // Set pins as digital inputs, disable pullups and set pins low since
  // SI32_PBSTD_A_set_pins_digital_input sets latch high
  for( i=0; i<4; i++)
  {
    SI32_PBSTD_A_set_pins_digital_input( port_std[ i ], 0xFFFF);
    SI32_PBSTD_A_disable_pullup_resistors( port_std[ i ] );
    SI32_PBSTD_A_write_pins_low( port_std[ i ], 0xFFFF );
  }

  // Attempt to minimize current on I2C pins by enabling pullups again on
  // PB0 & resetting pins as digital input (sets latch high)
  SI32_PBSTD_A_enable_pullup_resistors( port_std[ 0 ] );
  SI32_PBSTD_A_set_pins_digital_input( port_std[ 0 ], 0x6000);
  SI32_PBSTD_A_enable_pullup_resistors( port_std[ 3 ] );

  // Prep PBHD for PM9 and set up as digital inputs as done with
  // PBSTD ports.
  SI32_PBHD_A_disable_bias( SI32_PBHD_4 );
  SI32_PBHD_A_disable_pin_current_limit( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_set_pins_digital_input( SI32_PBHD_4, 0x3F );
  SI32_PBHD_A_disable_pullup_resistors( SI32_PBHD_4 );
  SI32_PBHD_A_write_pins_low( SI32_PBHD_4, 0x3F );

  // Mask low priority interrupts from waking us
  __set_BASEPRI(0x40);

  // DISABLE all wakeup sources
  SI32_PMU_A_write_wakeen(SI32_PMU_0, 0x0);


